#+TITLE:XenHunt Config (other)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's config of other things
#+STARTUP: content
#+PROPERTY: header-args :tangle other.el
* Easysession
:PROPERTIES:
:CUSTOM_ID: easysession
:END:
#+begin_src emacs-lisp
(use-package easysession
  :defer 2
  ;; :commands
  ;; (easysession-switch-to easysession-save-as)
  ;; :general
  ;; (:states 'normal '("TAB"))
  :config
  (defun my-setup-easy-session ()
    ;; (easysession-load-including-geometry)
    (easysession-save-mode)
    (remove-hook 'server-after-make-frame-hook #'my-setup-easy-session))

  (add-hook 'server-after-make-frame-hook #'my-setup-easy-session)
  (leader-key
    "TAB" '(:ignore t :wk "Session")
    "TAB TAB" '(easysession-switch-to :wk "Switch")
    "TAB s" '(easysession-save-as :wk "Save")
    "TAB d" '(easysession-delete :wk "Delete")))
    #+end_src

#+RESULTS:
: [nil 26444 1065 868595 nil elpaca-process-queues nil nil 730000 nil]

** Corfu
:PROPERTIES:
:CUSTOM_ID: corfu
:END:
#+begin_src emacs-lisp
(use-package corfu
  ;; Optional customizations
  :custom
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ;; Enable auto completion
  (corfu-separator ?\s)          ;; Orderless field separator
  ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  ;; (corfu-preview-current nil)    ;; Disable current candidate preview
  (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  (corfu-scroll-margin 5)        ;; Use scroll margin
  (corfu-auto-delay 0.2)
  (corfu-popupinfo-delay '(0.0 . 0.0))
  ;; Enable Corfu only for certain modes.

  :hook ((prog-mode . corfu-mode))
  ;;        (shell-mode . corfu-mode)
  ;;        (eshell-mode . corfu-mode))

  ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
  ;; be used globally (M-/).  See also the customization variable
  ;; `global-corfu-modes' to exclude certain modes
  :bind
  (:map corfu-map
        ("TAB" . corfu-next)
        ([tab] . corfu-next)
        ("S-TAB" . corfu-previous)
        ([backtab] . corfu-previous)
        ("C-SPC" . corfu-insert-separator))
  :init
  (global-corfu-mode)
  (corfu-popupinfo-mode)

  :config
  (defun corfu-enable-in-minibuffer ()
    "Enable Corfu in the minibuffer."
    (when (local-variable-p 'completion-at-point-functions)
      ;; (setq-local corfu-auto nil) ;; Enable/disable auto completion
      (setq-local corfu-echo-delay nil ;; Disable automatic echo and popup
                  corfu-popupinfo-delay nil)
      (corfu-mode 1)))
  (add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer)
  (corfu-history-mode)
  (add-to-list 'savehist-additional-variables 'corfu-history)
  
  (general-define-key
   :keymaps '(corfu-popupinfo-map)
   ;; :prefix "SPC"
   ;; "c" '(:ignore t :wk "Code")
   "C-s-<down>" '(corfu-popupinfo-scroll-up :wk "Down frame")
   "C-s-<up>" '(corfu-popupinfo-scroll-down :wk "Up frame")
   )
  )
;;(elpaca-wait)
#+end_src

#+RESULTS:
: [nil 26646 22564 99425 nil elpaca-process-queues nil nil 683000 nil]

** Marginalia 
:PROPERTIES:
:CUSTOM_ID: marginalia
:END:
#+begin_src emacs-lisp
;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))
#+end_src

#+RESULTS:
: [nil 26333 27716 331036 nil elpaca-process-queues nil nil 713000 nil]

* Casual
:PROPERTIES:
:CUSTOM_ID: casual
:END:
#+begin_src emacs-lisp
(use-package casual ;; A collection of  user interfaces for various built-in Emacs modes.
  :defer 2
  :custom
  (casual-lib-use-unicode t)
  (casual-dired-use-unicode-symbols t)
  :general
  (:states 'normal :keymaps 'org-agenda-mode-map "C-o" 'casual-agenda-tmenu)
  (:states 'normal :keymaps 'bookmark-bmenu-mode-map "C-o" 'casual-bookmarks-tmenu)
  (:states 'normal :keymaps 'calendar-mode-map "C-o" 'casual-calendar-tmenu)
  (:states 'normal :keymaps 'ibuffer-mode-map "C-o" 'casual-ibuffer-tmenu)
  (:states 'normal :keymaps 'calc-mode-map "C-o" 'casual-calc-tmenu)
  (:states 'normal :keymaps 'dired-mode-map "C-o" 'casual-dired-tmenu)
  (:states 'normal :keymaps 'dired-mode-map "s" 'casual-dired-sort-by-tmenu)
  (:states 'normal :keymaps 'image-mode-map "C-o" 'casual-image-tmenu)
  (:states 'normal :keymaps 'Info-mode-map "C-o" 'casual-info-tmenu)
  (:states 'normal :keymaps 'Man-mode-map "C-o" 'casual-man-tmenu)
  (:states 'normal :keymaps 'help-mode-map "C-o" 'casual-help-tmenu)
  :init
  (require 'casual-image)
  ;; :config
  ;; (transient-append suffix )
  )

(use-package casual-avy
  :defer 2
  :custom
  (avy-ignored-modes
   '(image-mode doc-view-mode pdf-view-mode exwm-mode))
  :general
  (:states 'normal "SPC j" 'casual-avy-tmenu))
#+end_src

#+RESULTS:
: [nil 26464 9225 305972 nil elpaca-process-queues nil nil 523000 nil]

* Djvu
:PROPERTIES:
:CUSTOM_ID: djvu
:END:
#+begin_src emacs-lisp
(use-package djvu)
(use-package djvu3
  ;; :defer 2
  :after djvu
  :ensure (djvu3 :type git :host github :repo "dalanicolai/djvu3" :files ("djvu3.el")))
#+end_src

#+RESULTS:
: [nil 26327 26259 966804 nil elpaca-process-queues nil nil 85000 nil]
* Trashed
:PROPERTIES:
:CUSTOM_ID: trashed
:END:
#+begin_src emacs-lisp
(use-package trashed
  :commands (trashed))
#+end_src

#+RESULTS:
: [nil 26446 47162 87282 nil elpaca-process-queues nil nil 918000 nil]

* Screenshot
:PROPERTIES:
:CUSTOM_ID: screenshot
:END:
#+begin_src emacs-lisp
(use-package screenshot
  :ensure (screenshot :type git :host github :repo "tecosaur/screenshot" :build (:not compile))
  :if (display-graphic-p)
  :commands (screenshot)
  :init
  (leader-key "S" 'screenshot))
#+end_src

#+RESULTS:
: [nil 26456 23223 773106 nil elpaca-process-queues nil nil 923000 nil]

* Quick-Sdcv
:PROPERTIES:
:CUSTOM_ID: quick-sdcv
:END:
#+begin_src emacs-lisp
(use-package quick-sdcv
  :init
  (leader-key
    "sw" '(quick-sdcv-search-at-point :wk "Search word at point")
    "sW" '(quick-sdcv-search-input :wk "Search word at input"))
  :config
  (add-hook 'markdown-mode-hook
          #'(lambda()
              (setq-local evil-lookup-func #'quick-sdcv-search-at-point)))
  (add-hook 'quick-sdcv-mode-hook
          #'(lambda()
              (setq-local evil-lookup-func #'quick-sdcv-search-at-point))))
#+end_src

#+RESULTS:
: [nil 26508 43412 335088 nil elpaca-process-queues nil nil 32000 nil]

* Emojify
:PROPERTIES:
:CUSTOM_ID: emojify
:END:
#+begin_src emacs-lisp
(use-package emojify
  :defer 2
  :init
  ;; (add-hook 'after-init-hook #'global-emojify-mode)
  )
#+end_src

#+RESULTS:
: [nil 26663 26692 614433 nil elpaca-process-queues nil nil 142000 nil]

* Bufferfile
:PROPERTIES:
:CUSTOM_ID: bufferfile
:END:
#+begin_src emacs-lisp
(use-package bufferfile
  :config
  (leader-key
    "ff"  '(:ignore t :wk "Current bufferfile")
    "ffs" '(save-buffer :wk "Save")
    "ffc" '(bufferfile-copy :wk "Copy")
    "ffr" '(bufferfile-rename :wk "Rename")
    "ffd" '(bufferfile-delete :wk "Delete")))
#+end_src

#+RESULTS:
: [nil 26739 43080 518873 nil elpaca-process-queues nil nil 643000 nil]

